# 6variant

### 1. 	Выписана пара чисел: 1,\ 1. Между единицами записывают их сумму: 1,\ 2,\ 1. Повторив эту операцию ещё раз, получим набор 1,\ 3,\ 2,\ 3,\ 1. После следующей операции будут выписаны числа 1,\ 4,\ 3,\ 5,\ 2,\ 5,\ 3,\ 4,\ 1. Какова будет сумма всех чисел после n операций? 


### **Решение первой задачи**:

Для решения этой задачи можно заметить некоторую закономерность в построении числовых последовательностей после каждой операции.

Рассмотрим последовательность чисел, полученную после выполнения каждой операции:

1-я операция: 1

2-я операция: 1, 2, 1

3-я операция: 1, 3, 2, 3, 1

4-я операция: 1, 4, 3, 5, 2, 5, 3, 4, 1

Заметим, что после каждой операции находятся все числа, полученные на предыдущих операциях, включая дополнительные числа, добавленные на текущей операции. Это означает, что каждая последующая операция расширяет предыдущую последовательность, добавляя новые числа между существующими.

Теперь рассмотрим количество чисел, полученных после каждой операции:

1-я операция: 1 число
2-я операция: 3 числа
3-я операция: 5 чисел
4-я операция: 9 чисел

Заметим, что количество чисел после каждой операции можно выразить как $2^n-1$ , где n - номер операции.

Теперь найдем сумму всех чисел после n операций. Для этого нужно просуммировать все числа, полученные после каждой операции.

Сумма чисел после n операций будет равна сумме первых n элементов последовательности чисел, полученной после каждой операции.

Мы знаем, что количество чисел после каждой операции равно $2^n-1$ . Поэтому, чтобы найти сумму всех чисел после n операций, нужно просуммировать первые n элементов последовательности $2^n-1$ .

Сумма первых n элементов последовательности 2^n-1 вычисляется по формуле суммы арифметической прогрессии: $S_n = (\frac{n}{2})(a_1 + a_n)$ , где $S_n$ - сумма первых $n$ элементов, $a_1$ - первый элемент последовательности, $a_n$ - последний элемент последовательности.

В нашем случае первый элемент $a_1$ = 1, последний элемент $a_n$ = $2^n-1$ .

Таким образом, сумма всех чисел после n операций будет равна: $S_n = (\frac{n}{2})(1 + 2^n-1)$ .

Например, если $n = 4$ , то сумма всех чисел после 4 операций будет: $S_4 = (\frac{4}{2})(1 + 2^4-1) = 2(1 + 15) = 32$ .

Общая формула для вычисления суммы всех чисел после n операций будет выглядеть следующим образом:

$$S_n = (\frac{n}{2})(1 + 2^n-1)$$



### 2. **Докажите для чисел Фибоначчи тождество $F_1^2+F_2^2+\ldots+\ F_n^2=F_nF_{n+1}$**

### **Решение второй задачи**


Воспользуемся математической индукцией.

Тождество Фибоначчи: $F_1^2 + F_2^2 + \ldots + F_n^2 = F_n \cdot F_{n+1}$.

Доказательство по индукции:

Базовый случай: Проверим выполнение тождества для $n = 1$ .
Для $n = 1$ , левая часть равна $F_1^2$, а правая часть равна $F_1 \cdot F_2 = F_1^2$. Таким образом, базовый случай верен.

Индукционное предположение: Предположим, что тождество выполняется для некоторого k, то есть $F_1^2 + F_2^2 + \ldots + F_k^2 = F_k \cdot F_{k+1}$.

Индукционный шаг: Докажем, что тождество выполняется для n = k+1, используя индукционное предположение.

Рассмотрим левую часть для $n = k+1$ :
$F_1^2 + F_2^2 + \ldots + F_k^2 + F_{k+1}^2$.

Мы можем заметить, что это равно сумме из индукционного предположения ($F_1^2 + F_2^2 + \ldots + F_k^2$) и последнего члена $F_{k+1}^2$.

Заменим сумму по индукционному предположению:
$F_1^2 + F_2^2 + \ldots + F_k^2 + F_{k+1}^2 = F_k \cdot F_{k+1} + F_{k+1}^2$.

Мы можем факторизовать правую часть:
$F_k \cdot F_{k+1} + F_{k+1}^2 = F_{k+1} \cdot (F_k + F_{k+1})$.

Так как $F_{k+1} = F_k + F_{k-1}$ (свойство чисел Фибоначчи), мы можем заменить $F_{k+1}$ в последнем выражении:
$F_{k+1} \cdot (F_k + F_{k+1}) = F_{k+1} \cdot F_{k+2}$.

Таким образом, мы получили правую часть тождества для n = k+1.

Итак, мы показали, что если тождество выполняется для некоторого k, то оно также выполняется для $n = k+1$ . Таким образом, по принципу математической индукции, тождество выполняется для всех натуральных чисел n.

**ч.т.д.**


### 3. 	**Сколько существует способов представить натуральное число n в виде суммы единиц и двоек? Например,\ n=3: 3=1+1+1;\ 3=1+2;\ 3=2+1 – три способа!**


### **Решение третьей задачи**

Количество способов представить натуральное число n в виде суммы единиц и двоек можно рассмотреть с помощью метода динамического программирования.

Обозначим количество способов представить число n в виде суммы единиц и двоек как $S(n)$.

Базовые случаи:

Если $n = 0$, то есть нет числа для представления, то $S(0) = 1$.
Если $n = 1$, то есть только один способ представления: $1 = 1$, поэтому $S(1) = 1$.
Рекуррентное соотношение:
Для числа $n > 1$ существуют два возможных случая:

Если в представлении суммы есть хотя бы одна двойка, то оставшуюся сумму можно представить с помощью $S(n-2)$ способов, так как мы уменьшили число на 2.
Если в представлении суммы нет двоек, то оставшуюся сумму можно представить с помощью $S(n-1)$ способов, так как мы уменьшили число на 1.
Суммируя эти два случая, получаем рекуррентное соотношение:
$S(n) = S(n-1) + S(n-2)$

Вычисление:
Можно использовать динамическое программирование для вычисления значений $S(n)$ начиная с базовых случаев.

Вот пример кода на C++, который реализует вычисление количества способов представления числа n в виде суммы единиц и двоек:

```cpp
#include <iostream>
using namespace std;

int countWays(int n) {
    if (n == 0) {
        return 1;
    } else if (n == 1) {
        return 1;
    } else {
        int prev1 = 1;
        int prev2 = 1;
        for (int i = 2; i <= n; i++) {
            int curr = prev1 + prev2;
            prev2 = prev1;
            prev1 = curr;
        }
        return prev1;
    }
}

int main() {
    int n = 3;
    int ways = countWays(n);
    cout << "Количество способов представления числа " << n << " в виде суммы единиц и двоек: " << ways << endl;
    return 0;
}
```

В данном примере мы вычисляем количество способов представления числа 3 в виде суммы единиц и двоек. Результат будет 3, что соответствует представлениям: 3=1+1+1, 3=1+2, 3=2+1.





